//Задание3

Console.WriteLine("Введите число");
int num = Convert.ToInt32(Console.ReadLine());
if (num%2 == 0)
    {
        Console.WriteLine(num + " - четное число");
    }
else if (num%2 == 1)
    {
        Console.WriteLine(num + " - нечетное число");
    }




